// * npx create-react-app client --template typescript

// todo Библиотека VS фреймворк
// ? Библиотека
// * более гибкая
// * позволяет брать из себя небольшие куски и использовать
// ? Фреймворк
// * жёсткие правила, которым нужно следовать
// * не позволяет брать из себя небольшие куски

// todo React-компонент & React-элемент
// * React-компонент — функция или класс для создания React-элемента.
// * React-элемент — объект с описанием того, что React должен отрисовать в DOM-дереве.

// ! if...else в return компонента JSX не работает!

// todo React.Fragment === <></> - обёртка нескольких элементов в один, которого нет в DOM

// todo props (properties) (свойства)
// * Объект со свойствами компонента, передаваемый из родительского компонента
// ? правила пропсов:
// * передаются от родителя к детям и не передаются обратно
// * ф-ии можно передать пропсом вниз и вызывать внизу
// * пропсы нельзя изменить в получаемом их компоненте


// todo Компонент ререндерится:
// * 1 Рендерится родительский компонент
// * 2 Сменился стейт
// * 3 Изменились пропсы

// * memo - Для компонентов
// * useCallback - для функций
// * useMemo - Для результата отработанных функций


// * npm i react-router-dom
